src/cf/Documents/ПередачаДелВАрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПередачаДелВАрхив</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДелХраненияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыгрузкиВАрхив</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаСАрхивом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДелаХраненияДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДелоХраненияДокументов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВариантыФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бумажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электронная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БумажнаяИлиЭлектронная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КатегорииДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>КатегорииДел</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВременноеДо10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеСвыше10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыОбменаСАрхивом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбменаСАрхивом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВАрхивВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГотовКВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриВыгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбнаруженыОшибкиПриПроверкеВАрхиве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВАрхив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ДелаХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДелаХраненияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелоЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМестоХранения</Name>
					<Comment>Последняя актуальная версия 1.4.3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтноситсяКНоменклатуреДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НоменклатураДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НоменклатураДел</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидыДокументовЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросыДеятельностиЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентыЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСтатей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаЭПК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛичномуСоставу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОперативногоХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/РазделыНоменклатурыДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РазделыНоменклатурыДел</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ПередачаДелВАрхив/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Печать итоговой записи
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПередачаДелВАрхив";
	КомандаПечати.Идентификатор = "Опись";
	КомандаПечати.Представление = НСтр("ru = 'Опись дел'");
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ФормаДокументов", Перечисления.ВариантыФормДокументов.Бумажная);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПередачаДелВАрхив";
	КомандаПечати.Идентификатор = "ОписьЭлектронныхДокументов";
	КомандаПечати.Представление = НСтр("ru = 'Опись электронных документов'");
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ФормаДокументов", Перечисления.ВариантыФормДокументов.Электронная);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Опись") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Опись", НСтр("ru = 'Опись дел'"),
			ПечатьОписи(МассивОбъектов, ОбъектыПечати), , "Документ.ПередачаДелВАрхив.ПФ_MXL_Опись");
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОписьЭлектронныхДокументов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ОписьЭлектронныхДокументов", НСтр("ru = 'Опись электронных документов'"),
			ПечатьОписиЭлектронныхДокументов(МассивОбъектов, ОбъектыПечати), , "Документ.ПередачаДелВАрхив.ПФ_MXL_ОписьЭлектронныхДокументов");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОписи(МассивОбъектов, ОбъектыПечати) Экспорт
	
	// Создаем табличный документ и устанавливаем имя параметров печати
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ОписьПередачиДелВАрхив";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	// Получаем запросом необходимые данные
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаДелВАрхив.Ссылка КАК Ссылка,
	|	ПередачаДелВАрхив.Организация КАК Организация,
	|	ПередачаДелВАрхив.Дата КАК Дата,
	|	ПередачаДелВАрхив.Номер КАК Номер,
	|	ПередачаДелВАрхив.ФормаДокументов,
	|	ПередачаДелВАрхив.Подразделение,
	|	ПередачаДелВАрхив.ДатаПередачи,
	|	ПередачаДелВАрхив.ДатаПриемки,
	|	ПередачаДелВАрхив.Передал,
	|	ПередачаДелВАрхив.Создал,
	|	ПередачаДелВАрхив.Принял
	|ИЗ
	|	Документ.ПередачаДелВАрхив КАК ПередачаДелВАрхив
	|ГДЕ
	|	ПередачаДелВАрхив.Ссылка В (&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаСсылка = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураСпр.Индекс КАК Индекс,
	|	НоменклатураСпр.Раздел КАК Раздел,
	|	НоменклатураСпр.СрокХранения КАК СрокХранения,
	|	НоменклатураСпр.ОтметкаЭПК КАК ОтметкаЭПК,
	|	НоменклатураСпр.КатегорияДела КАК КатегорияДела,
	|	ДелаСпр.Комментарий КАК Примечание,
	|	ДелаСпр.ДатаНачала КАК ДатаНачала,
	|	ДелаСпр.ДатаОкончания КАК ДатаОкончания,
	|	ДелаСпр.КоличествоЛистов КАК КоличествоЛистов,
	|	ТабличнаяЧасть.Ссылка КАК Ссылка,
	|	ДелаСпр.Ссылка КАК Дело,
	|	ДелаСпр.ПолноеНаименование КАК Наименование
	|ИЗ
	|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ТабличнаяЧасть
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелаХраненияДокументов КАК ДелаСпр
	|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ДелаСпр.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК НоменклатураСпр
	|		ПО ДелаСпр.НоменклатураДел = НоменклатураСпр.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыНоменклатурыДел КАК РазделыСпр
	|		ПО НоменклатураСпр.Раздел = РазделыСпр.Ссылка
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка В (&МассивОбъектов)
	|	И ТабличнаяЧасть.ДелоХраненияДокументов <> ЗНАЧЕНИЕ(Справочник.ДелаХраненияДокументов.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Индекс,
	|	Раздел
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Раздел ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДетали = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаДелВАрхив.ПФ_MXL_Опись");
	ОбластьОрганизация = Макет.ПолучитьОбласть("Организация");
	ОбластьПодразделение = Макет.ПолучитьОбласть("Подразделение");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
	ОбластьРаздел 	 = Макет.ПолучитьОбласть("Раздел");
	ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалПринял 	 = Макет.ПолучитьОбласть("ПодвалПринял");
	ОбластьПодвалПередал 	 = Макет.ПолучитьОбласть("ПодвалПередал");
	
	ПервыйДокумент = Истина;
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки с которой начали выводить текущий документ
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Организация и подразделение
		ОбластьОрганизация.Параметры.НаименованиеПредприятия = РаботаСОрганизациями.ПолучитьНаименованиеОрганизации(
			ВыборкаСсылка.Организация);
		ТабличныйДокумент.Вывести(ОбластьОрганизация);
		
		Если ЗначениеЗаполнено(ВыборкаСсылка.Подразделение) Тогда
			ОбластьПодразделение.Параметры.НаименованиеПодразделения = ВыборкаСсылка.Подразделение;
			ТабличныйДокумент.Вывести(ОбластьПодразделение);
		КонецЕсли;
		
		// заголовок
		ОбластьЗаголовок.Параметры.НомерДок = ВыборкаСсылка.Номер;
		
		СписокПериодовДокумента = ПериодыДокументовПоСдаточнойОписи(ВыборкаСсылка.Ссылка);
		Если СписокПериодовДокумента.Количество() = 1 Тогда
			ОтчетныйГод = СписокПериодовДокумента[0];
		ИначеЕсли СписокПериодовДокумента.Количество() > 1 Тогда
			ОтчетныйГод = СтрСоединить(СписокПериодовДокумента, "-");
		Иначе
			ОтчетныйГод = Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0");
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.ОтчетныйПериод = СтрШаблон("%1 %2", ОтчетныйГод,
			?(СписокПериодовДокумента.Количество() > 1, "годы", "год"));
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// шапка
		ТабличныйДокумент.Вывести(ОбластьШапка);
		Номер = 0;
		
		// разделы
		Если ВыборкаДетали.НайтиСледующий(ВыборкаСсылка.Ссылка, "Ссылка") Тогда
			
			ВыборкаРазделы = ВыборкаДетали.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРазделы.Следующий() Цикл
				
				СвойстваРаздела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаРазделы.Раздел, "Индекс, Наименование");
				
				ОбластьРаздел.Параметры.Индекс = СвойстваРаздела.Индекс;
				ОбластьРаздел.Параметры.Наименование = СвойстваРаздела.Наименование;
				ТабличныйДокумент.Вывести(ОбластьРаздел);
				
				ВыборкаСтроки = ВыборкаРазделы.Выбрать();
				Пока ВыборкаСтроки.Следующий() Цикл
					Номер = Номер + 1;
					
					ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
					ОбластьСтрока.Параметры.Номер = Номер;
					ОбластьСтрока.Параметры.КрайниеДаты = 
						Формат(ВыборкаСтроки.ДатаНачала, "ДЛФ=D") + " - " +
							Формат(ВыборкаСтроки.ДатаОкончания, "ДЛФ=D");
					
					СрокХранения = ВыборкаСтроки.СрокХранения;
					ОтметкаЭПК = ВыборкаСтроки.ОтметкаЭПК;
					Если ВыборкаСтроки.КатегорияДела = Перечисления.КатегорииДел.Постоянное Тогда
						ОбластьСтрока.Параметры.СрокХранения = "";
					ИначеЕсли ТипЗнч(СрокХранения) = Тип("Число") Тогда 
						ОбластьСтрока.Параметры.СрокХранения =
							Строка(СрокХранения) + " " + ДелопроизводствоКлиентСервер.ПодписьЛет(СрокХранения) +
								?(ОтметкаЭПК, " ЭПК", "");
					Иначе
						ОбластьСтрока.Параметры.СрокХранения = Строка(СрокХранения) + ?(ОтметкаЭПК, " ЭПК", "");
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// подвал
		КоличествоДелСтрокой = СокрЛП(НРег(ЧислоПрописью(Номер, , ",,,с,,,,,0")));
		ОбластьПодвал.Параметры.КоличествоДел = 
			Формат(Номер, "ЧГ=") + " (" + КоличествоДелСтрокой + ")"
			+ "" + СтрЗаменить(СокрЛП(НРег(ЧислоПрописью(Номер, , "дело,дела,дел,с,,,,,0"))), КоличествоДелСтрокой, "");
		ОбластьПодвал.Параметры.НачальныйНомер = 1;
		ОбластьПодвал.Параметры.КонечныйНомер = Номер;
		ОбластьПодвал.Параметры.ДатаДок = Формат(ВыборкаСсылка.Дата, "ДЛФ=D");
		
		РуководительДОУ =
			РаботаСОрганизациями.ПолучитьОтветственноеЛицо("РуководительСлужбыДОУ", ВыборкаСсылка.Организация, ВыборкаСсылка.Дата);
		ОбластьПодвал.Параметры.РуководительДОУ =
			?(ЗначениеЗаполнено(РуководительДОУ), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				РуководительДОУ, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО руководителя ДОУ>'"));
		ДолжностьРуководителяДОУ = РаботаСПользователями.ПолучитьДолжность(РуководительДОУ);
		ОбластьПодвал.Параметры.ДолжностьРуководителяДОУ =
			?(ЗначениеЗаполнено(ДолжностьРуководителяДОУ), ДолжностьРуководителяДОУ, НСтр("ru = '<Должность руководителя ДОУ>'"));
		
		Если ЗначениеЗаполнено(ВыборкаСсылка.Создал) Тогда
			ОтветственныйЗаДокумент = ВыборкаСсылка.Создал;
		Иначе
			ОтветственныйЗаДокумент = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Составитель = 
			ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				ОтветственныйЗаДокумент, "ПредставлениеВДокументах"); 
		
		ДолжностьСоставителя = РаботаСПользователями.ПолучитьДолжность(ОтветственныйЗаДокумент);
		ОбластьПодвал.Параметры.ДолжностьСоставителя = 
			?(ЗначениеЗаполнено(ДолжностьСоставителя), ДолжностьСоставителя, НСтр("ru = '<Должность составителя>'"));
		
		РуководительАрхива =
			РаботаСОрганизациями.ПолучитьОтветственноеЛицо(
				"РуководительАрхива", ВыборкаСсылка.Организация, ВыборкаСсылка.Дата);
		ОбластьПодвал.Параметры.РуководительАрхива =
			?(ЗначениеЗаполнено(РуководительАрхива), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				РуководительАрхива, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО руководителя архива>'"));
		ДолжностьРуководителяАрхива = РаботаСПользователями.ПолучитьДолжность(РуководительАрхива);
		ОбластьПодвал.Параметры.ДолжностьРуководителяАрхива = 
			?(ЗначениеЗаполнено(ДолжностьРуководителяАрхива), ДолжностьРуководителяАрхива, НСтр("ru = '<Должность руководителя архива>'"));
			
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ЧислоПрописьюВВинительномПадеже = СклонениеПредставленийОбъектов.ПросклонятьПредставление(
			СокрЛП(НРег(ЧислоПрописью(Номер, , ",,,ж,,,,,0"))), 4);
		КоличествоЕдиницСтрокой = Формат(Номер, "ЧГ=") + " (" + ЧислоПрописьюВВинительномПадеже + ")";
		
		Передал = ВыборкаСсылка.Передал;
		ОбластьПодвалПередал.Параметры.Передал = 
			?(ЗначениеЗаполнено(Передал), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				Передал, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО работника подразделения>'"));
		ДолжностьПередал = РаботаСПользователями.ПолучитьДолжность(Передал);
		ОбластьПодвалПередал.Параметры.ДолжностьПередал = 
			?(ЗначениеЗаполнено(ДолжностьПередал), ДолжностьПередал, НСтр("ru = '<Должность работника подразделения>'"));
		ОбластьПодвалПередал.Параметры.ДатаПередачи = 
			?(ЗначениеЗаполнено(ВыборкаСсылка.ДатаПередачи), Формат(ВыборкаСсылка.ДатаПередачи, "ДЛФ=D"),
				НСтр("ru = '<Дата передачи>'"));
		ОбластьПодвалПередал.Параметры.КоличествоДел = КоличествоЕдиницСтрокой;
		ТабличныйДокумент.Вывести(ОбластьПодвалПередал);
		
		Принял = ВыборкаСсылка.Принял;
		Если ТипЗнч(Принял) = Тип("Строка") Тогда
			ОбластьПодвалПринял.Параметры.Принял =
				?(ЗначениеЗаполнено(Принял), СокрЛП(Принял), НСтр("ru = '<ФИО работника архива>'"));
			ОбластьПодвалПринял.Параметры.ДолжностьПринял = НСтр("ru = '<Должность работника архива>'");
		Иначе
			ОбластьПодвалПринял.Параметры.Принял = 
				?(ЗначениеЗаполнено(Принял), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
					Принял, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО работника архива>'"));
			ДолжностьПринял = РаботаСПользователями.ПолучитьДолжность(Принял);
			ОбластьПодвалПринял.Параметры.ДолжностьПринял = 
				?(ЗначениеЗаполнено(ДолжностьПринял), ДолжностьПринял, НСтр("ru = '<Должность работника архива>'"));
		КонецЕсли;
		ОбластьПодвалПринял.Параметры.ДатаПриемки = 
			?(ЗначениеЗаполнено(ВыборкаСсылка.ДатаПриемки), Формат(ВыборкаСсылка.ДатаПриемки, "ДЛФ=D"),
				НСтр("ru = '<Дата приемки>'"));
		
		ОбластьПодвалПринял.Параметры.КоличествоДел = КоличествоЕдиницСтрокой;
		ТабличныйДокумент.Вывести(ОбластьПодвалПринял);
		
		// В табличном документе зададим имя области в которую был 
		// выведен объект. Нужно для возможности печати по-комплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаСсылка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Формирует печатную форму Описи электронных документов
//
// Параметры:
//   МассивОбъектов  - Массив из ДокументСсылка.ПередачаДелВАрхив - Массив ссылок на объекты которые нужно распечатать
//   ОбъектыПечати   - СписокЗначений - список объектов печати;
//
// Возвращаемое значение:
//  ТабличныйДокумент - ТабличныйДокумент - печатная форма
//
Функция ПечатьОписиЭлектронныхДокументов(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ОписьЭлектронныхДокументов";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ВидыОписей = ВидОписиПоНоменклатуреДел(МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПередачаДелВАрхив.Ссылка КАК Ссылка,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Организация КАК Организация,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс КАК Индекс,
		|	Номенклатура.СрокХранения КАК СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)) КАК Наименование,
		|	ВнутренниеДокументы.Ссылка КАК Документ,
		|	ВнутренниеДокументы.РегистрационныйНомер КАК НомерДокумента,
		|	НАЧАЛОПЕРИОДА(ВнутренниеДокументы.ДатаРегистрации, ДЕНЬ) КАК ДатаДокумента,
		|	ВнутренниеДокументы.Заголовок КАК ЗаголовокДокумента,
		|	ВнутренниеДокументы.ВидДокумента,
		|	Файлы.Наименование КАК ИмяФайла,
		|	Файлы.ТекущаяВерсияДатаСоздания КАК ДатаИзменения,
		|	Файлы.ТекущаяВерсияРазмер КАК Размер,
		|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ФайлыДокумента.Ссылка), 0) КАК КоличествоФайлов,
		|	ЕСТЬNULL(СУММА(ФайлыДокумента.ТекущаяВерсияРазмер), 0) КАК Объем
		|ИЗ
		|	Документ.ПередачаДелВАрхив КАК ПередачаДелВАрхив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ТабличнаяЧасть
		|		ПО ТабличнаяЧасть.Ссылка = ПередачаДелВАрхив.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ВнутренниеДокументы.Дело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелаХраненияДокументов КАК ДелаТома
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ДелаТома.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК Номенклатура
		|		ПО ДелаТома.НоменклатураДел = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК ФайлыДокумента
		|		ПО ВнутренниеДокументы.Ссылка = ФайлыДокумента.ВладелецФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО ВнутренниеДокументы.Ссылка = Файлы.ВладелецФайла
		|ГДЕ
		|	ПередачаДелВАрхив.Ссылка В (&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	ПередачаДелВАрхив.Ссылка,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.Организация,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс,
		|	Номенклатура.СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)),
		|	ВнутренниеДокументы.Ссылка,
		|	ВнутренниеДокументы.РегистрационныйНомер,
		|	ВнутренниеДокументы.Заголовок,
		|	ВнутренниеДокументы.ВидДокумента,
		|	Файлы.Наименование,
		|	Файлы.ТекущаяВерсияДатаМодификацииФайла,
		|	Файлы.ТекущаяВерсияРазмер,
		|	Файлы.ТекущаяВерсияРасширение,
		|	Файлы.Ссылка,
		|	Файлы.ТекущаяВерсияДатаСоздания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаДелВАрхив.Ссылка КАК Ссылка,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Организация КАК Организация,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс КАК Индекс,
		|	Номенклатура.СрокХранения КАК СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)) КАК Наименование,
		|	ВходящиеДокументы.Ссылка КАК Документ,
		|	ВходящиеДокументы.РегистрационныйНомер КАК НомерДокумента,
		|	НАЧАЛОПЕРИОДА(ВходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ВходящиеДокументы.Заголовок КАК ЗаголовокДокумента,
		|	ВходящиеДокументы.ВидДокумента,
		|	Файлы.Наименование КАК ИмяФайла,
		|	Файлы.ТекущаяВерсияДатаСоздания КАК ДатаИзменения,
		|	Файлы.ТекущаяВерсияРазмер КАК Размер,
		|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ФайлыДокумента.Ссылка), 0) КАК КоличествоФайлов,
		|	ЕСТЬNULL(СУММА(ФайлыДокумента.ТекущаяВерсияРазмер), 0) КАК Объем
		|ИЗ
		|	Документ.ПередачаДелВАрхив КАК ПередачаДелВАрхив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ТабличнаяЧасть
		|		ПО ТабличнаяЧасть.Ссылка = ПередачаДелВАрхив.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ВходящиеДокументы.Дело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелаХраненияДокументов КАК ДелаТома
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ДелаТома.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК Номенклатура
		|		ПО ДелаТома.НоменклатураДел = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК ФайлыДокумента
		|		ПО ВходящиеДокументы.Ссылка = ФайлыДокумента.ВладелецФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО ВходящиеДокументы.Ссылка = Файлы.ВладелецФайла
		|ГДЕ
		|	ПередачаДелВАрхив.Ссылка В (&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	ПередачаДелВАрхив.Ссылка,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.Организация,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс,
		|	Номенклатура.СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)),
		|	ВходящиеДокументы.Ссылка,
		|	ВходящиеДокументы.РегистрационныйНомер,
		|	ВходящиеДокументы.Заголовок,
		|	ВходящиеДокументы.ВидДокумента,
		|	Файлы.Наименование,
		|	Файлы.ТекущаяВерсияДатаМодификацииФайла,
		|	Файлы.ТекущаяВерсияРазмер,
		|	Файлы.ТекущаяВерсияРасширение,
		|	Файлы.Ссылка,
		|	Файлы.ТекущаяВерсияДатаСоздания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаДелВАрхив.Ссылка КАК Ссылка,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Организация КАК Организация,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс КАК Индекс,
		|	Номенклатура.СрокХранения КАК СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)) КАК Наименование,
		|	ИсходящиеДокументы.Ссылка КАК Документ,
		|	ИсходящиеДокументы.РегистрационныйНомер КАК НомерДокумента,
		|	НАЧАЛОПЕРИОДА(ИсходящиеДокументы.ДатаРегистрации, ДЕНЬ),
		|	ИсходящиеДокументы.Заголовок КАК ЗаголовокДокумента,
		|	ИсходящиеДокументы.ВидДокумента,
		|	Файлы.Наименование КАК ИмяФайла,
		|	Файлы.ТекущаяВерсияДатаСоздания КАК ДатаИзменения,
		|	Файлы.ТекущаяВерсияРазмер КАК Размер,
		|	Файлы.ТекущаяВерсияРасширение КАК Расширение,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(ФайлыДокумента.Ссылка), 0) КАК КоличествоФайлов,
		|	ЕСТЬNULL(СУММА(ФайлыДокумента.ТекущаяВерсияРазмер), 0) КАК Объем
		|ИЗ
		|	Документ.ПередачаДелВАрхив КАК ПередачаДелВАрхив
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ТабличнаяЧасть
		|		ПО ТабличнаяЧасть.Ссылка = ПередачаДелВАрхив.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ИсходящиеДокументы.Дело
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДелаХраненияДокументов КАК ДелаТома
		|		ПО ТабличнаяЧасть.ДелоХраненияДокументов = ДелаТома.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК Номенклатура
		|		ПО ДелаТома.НоменклатураДел = Номенклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК ФайлыДокумента
		|		ПО ИсходящиеДокументы.Ссылка = ФайлыДокумента.ВладелецФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО ИсходящиеДокументы.Ссылка = Файлы.ВладелецФайла
		|ГДЕ
		|	ПередачаДелВАрхив.Ссылка В (&МассивОбъектов)
		|СГРУППИРОВАТЬ ПО
		|	ПередачаДелВАрхив.Ссылка,
		|	ПередачаДелВАрхив.Номер,
		|	ПередачаДелВАрхив.ФормаДокументов,
		|	ПередачаДелВАрхив.Организация,
		|	ПередачаДелВАрхив.Дата,
		|	ПередачаДелВАрхив.Передал,
		|	ПередачаДелВАрхив.Создал,
		|	ПередачаДелВАрхив.ДатаПередачи,
		|	ПередачаДелВАрхив.ДатаПриемки,
		|	ПередачаДелВАрхив.Принял,
		|	ПередачаДелВАрхив.Подразделение,
		|	ПередачаДелВАрхив.СтатусВыгрузкиВАрхив,
		|	Номенклатура.Индекс,
		|	Номенклатура.СрокХранения,
		|	Номенклатура.КатегорияДела,
		|	ВЫРАЗИТЬ(ДелаТома.ПолноеНаименование КАК СТРОКА(100)),
		|	ИсходящиеДокументы.Ссылка,
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Заголовок,
		|	ИсходящиеДокументы.ВидДокумента,
		|	Файлы.Наименование,
		|	Файлы.ТекущаяВерсияДатаСоздания,
		|	Файлы.ТекущаяВерсияРазмер,
		|	Файлы.ТекущаяВерсияРасширение,
		|	Файлы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс,
		|	ДатаДокумента,
		|	НомерДокумента
		|АВТОУПОРЯДОЧИВАНИЕ
		|ИТОГИ
		|ПО
		|	Ссылка,
		|	Индекс,
		|	Документ";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ВыборкаДетали = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПередачаДелВАрхив.ПФ_MXL_ОписьЭлектронныхДокументов");
	ОбластьОрганизация = Макет.ПолучитьОбласть("Организация");
	ОбластьПодразделение = Макет.ПолучитьОбласть("Подразделение");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	НачальныйНомер = Неопределено;
	ПервыйДокумент = Истина; 
	Пока ВыборкаДетали.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ВыводитьРеестрФайлов = Истина;
		Если ПолучитьФункциональнуюОпцию("ИнтеграцияС1САрхивом")
			И ВыборкаДетали.СтатусВыгрузкиВАрхив = Перечисления.СтатусыОбменаСАрхивом.ПринятВАрхив Тогда
				ВыводитьРеестрФайлов = Ложь;
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
						
		// Номер строки с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Организация и подразделение
		ОбластьОрганизация.Параметры.НаименованиеОрганизации = 
			РаботаСОрганизациями.ПолучитьНаименованиеОрганизации(ВыборкаДетали.Организация);
		ТабличныйДокумент.Вывести(ОбластьОрганизация);
		
		Если ЗначениеЗаполнено(ВыборкаДетали.Подразделение) Тогда
			ОбластьПодразделение.Параметры.НаименованиеПодразделения = ВыборкаДетали.Подразделение;
			ТабличныйДокумент.Вывести(ОбластьПодразделение);
		КонецЕсли;
		
		// Заголовок.
		ОбластьЗаголовок.Параметры.ФормаДокументов = НСтр("ru = 'электронных документов'");
		ОбластьЗаголовок.Параметры.НомерОписи = ВыборкаДетали.Номер;
		ОбластьЗаголовок.Параметры.ВидОписи = ВидыОписей.Получить(ВыборкаДетали.Ссылка);
		
		СписокПериодовДокумента = ПериодыДокументовПоСдаточнойОписи(ВыборкаДетали.Ссылка);
		Если СписокПериодовДокумента.Количество() = 1 Тогда
			ОтчетныйГод = СписокПериодовДокумента[0];
		ИначеЕсли СписокПериодовДокумента.Количество() > 1 Тогда
			ОтчетныйГод = СтрСоединить(СписокПериодовДокумента, "-");
		Иначе
			ОтчетныйГод = Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0");
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.ОтчетныйПериод = СтрШаблон("%1 %2", ОтчетныйГод,
			?(СписокПериодовДокумента.Количество() > 1, "годы", "год"));
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Документы.
		Номер = 0;
		ОбщийОбъемФайлов = 0;

		ВыборкаИндексНоменклатуры = ВыборкаДетали.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИндексНоменклатуры.Следующий() Цикл
			
			ВыборкаДокументы = ВыборкаИндексНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДокументы.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ВыборкаДокументы.Документ) Тогда
					Продолжить;
				КонецЕсли;
				
				// Строки.
				ВыборкаСтроки = ВыборкаДокументы.Выбрать();
				Пока ВыборкаСтроки.Следующий() Цикл
					
					Номер = Номер + 1; 
					
					ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
					ОбластьСтрока.Параметры.Номер = Номер;
					ОбластьСтрока.Параметры.ЗаголовокДокумента = СтрШаблон("%1 %2",
						ВыборкаСтроки.ВидДокумента, ВыборкаСтроки.ЗаголовокДокумента);
						
					СрокХранения = ВыборкаСтроки.СрокХранения;
					Если ТипЗнч(СрокХранения) = Тип("Число") Тогда 
						ОбластьСтрока.Параметры.СрокХранения =
							Строка(СрокХранения) + " " + ДелопроизводствоКлиентСервер.ПодписьЛет(СрокХранения);
					Иначе
						ОбластьСтрока.Параметры.СрокХранения = СрокХранения;
					КонецЕсли;
					
					ОбщийОбъемФайлов = ОбщийОбъемФайлов + ВыборкаСтроки.Объем;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					
					Если Не ЗначениеЗаполнено(НачальныйНомер) Тогда
						НачальныйНомер = Номер;
					КонецЕсли;
					Прервать;
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		КонечныйНомер = Номер;
		
		// Подвал.
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ОбъемФайлов = ОбщийОбъемФайлов;
				
		КоличествоДокументовСтрокой = СокрЛП(НРег(ЧислоПрописью(Номер, , ",,,м,,,,,0")));
		ПредставлениеКоличестваДокументов = 
			Формат(Номер, "ЧГ=") + " (" + КоличествоДокументовСтрокой + ")"
				+ "" + СтрЗаменить(СокрЛП(НРег(ЧислоПрописью(Номер, , "электронный документ,электронных документа,электронных документов,м,,,,,0"))), КоличествоДокументовСтрокой, "");
		
		Если Не ЗначениеЗаполнено(Номер) Тогда
			ОбластьПодвал.Параметры.КоличествоДокументов = "- ( - )";
			ОбластьПодвал.Параметры.НачальныйНомер = "-";
			ОбластьПодвал.Параметры.КонечныйНомер = "-";
		Иначе
			КоличествоДокументовСтрокой = СокрЛП(НРег(ЧислоПрописью(Номер, , ",,,м,,,,,0")));
			ОбластьПодвал.Параметры.КоличествоДокументов = ПредставлениеКоличестваДокументов;
			ОбластьПодвал.Параметры.НачальныйНомер = НачальныйНомер;
			ОбластьПодвал.Параметры.КонечныйНомер = КонечныйНомер;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи"); 
		
		Если ЗначениеЗаполнено(ВыборкаДетали.Создал) Тогда
			ОтветственныйЗаДокумент = ВыборкаДетали.Создал;
		Иначе
			ОтветственныйЗаДокумент = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ОбластьПодписи.Параметры.Составитель = 
			ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				ОтветственныйЗаДокумент, "ПредставлениеВДокументах"); 
		
		ДолжностьСоставителя = РаботаСПользователями.ПолучитьДолжность(ОтветственныйЗаДокумент);
		ОбластьПодписи.Параметры.ДолжностьСоставителя = 
			?(ЗначениеЗаполнено(ДолжностьСоставителя), ДолжностьСоставителя, НСтр("ru = '<Должность составителя>'"));
		
		РуководительАрхива = РаботаСОрганизациями.ПолучитьОтветственноеЛицо(
			"РуководительАрхива", ВыборкаДетали.Организация, ТекущаяДатаСеанса());
		ОбластьПодписи.Параметры.РуководительАрхива = 
			?(ЗначениеЗаполнено(РуководительАрхива), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				РуководительАрхива, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО руководителя архива>'"));
		ДолжностьРуководителяАрхива = РаботаСПользователями.ПолучитьДолжность(РуководительАрхива);
		ОбластьПодписи.Параметры.ДолжностьРуководителяАрхива = 
			?(ЗначениеЗаполнено(ДолжностьРуководителяАрхива), ДолжностьРуководителяАрхива, НСтр("ru = '<Должность руководителя архива>'"));
		ОбластьПодписи.Параметры.ДатаДок = Формат(ВыборкаДетали.Дата, "ДЛФ=D");
		
		РуководительДОУ = РаботаСОрганизациями.ПолучитьОтветственноеЛицо("РуководительСлужбыДОУ", ВыборкаДетали.Организация, ВыборкаДетали.Дата);
		ОбластьПодписи.Параметры.РуководительДОУ = 
			?(ЗначениеЗаполнено(РуководительДОУ), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				РуководительДОУ, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО руководителя ДОУ>'"));
		ДолжностьРуководителяДОУ = РаботаСПользователями.ПолучитьДолжность(РуководительДОУ);
		ОбластьПодписи.Параметры.ДолжностьРуководителяДОУ = 
			?(ЗначениеЗаполнено(ДолжностьРуководителяДОУ), ДолжностьРуководителяДОУ, НСтр("ru = '<Должность руководителя ДОУ>'"));
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		ОбщийОбъемФайловСтрокой = СокрЛП(НРег(ЧислоПрописью(ОбщийОбъемФайлов, , ",,,м,,,,,0")));
		ОбластьКоличествоПередал = Макет.ПолучитьОбласть("КоличествоПередал");
		ОбластьКоличествоПередал.Параметры.КоличествоДокументов = ПредставлениеКоличестваДокументов;
		ОбластьКоличествоПередал.Параметры.ОбщийОбъемФайлов =
			Формат(ОбщийОбъемФайлов, "ЧГ=") + " (" + ОбщийОбъемФайловСтрокой + ")";
		ТабличныйДокумент.Вывести(ОбластьКоличествоПередал);
		
		ОбластьПодписиПередал = Макет.ПолучитьОбласть("ПодписиПередал");
		Передал = ВыборкаДетали.Передал;
		ОбластьПодписиПередал.Параметры.Передал = 
			?(ЗначениеЗаполнено(Передал), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
				Передал, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО работника подразделения>'"));
		ДолжностьПередал = РаботаСПользователями.ПолучитьДолжность(Передал);
		ОбластьПодписиПередал.Параметры.ДолжностьПередал = 
			?(ЗначениеЗаполнено(ДолжностьПередал), ДолжностьПередал, НСтр("ru = '<Должность работника подразделения>'"));
		ОбластьПодписиПередал.Параметры.ДатаПередачи = 
			?(ЗначениеЗаполнено(ВыборкаДетали.ДатаПередачи), Формат(ВыборкаДетали.ДатаПередачи, "ДЛФ=D"), 
				НСтр("ru = '<Дата передачи>'"));
		ТабличныйДокумент.Вывести(ОбластьПодписиПередал);
			
		ОбластьКоличествоПринял = Макет.ПолучитьОбласть("КоличествоПринял");
		ОбластьКоличествоПринял.Параметры.КоличествоДокументов = ПредставлениеКоличестваДокументов;
		ОбластьКоличествоПринял.Параметры.ОбщийОбъемФайлов =
			Формат(ОбщийОбъемФайлов, "ЧГ=") + " (" + ОбщийОбъемФайловСтрокой + ")";
		ТабличныйДокумент.Вывести(ОбластьКоличествоПринял);
		
		ОбластьПодписиПринял = Макет.ПолучитьОбласть("ПодписиПринял");
		Принял = ВыборкаДетали.Принял;
		Если ТипЗнч(Принял) = Тип("Строка") Тогда
			ОбластьПодписиПринял.Параметры.Принял =
				?(ЗначениеЗаполнено(Принял), СокрЛП(Принял), НСтр("ru = '<ФИО работника архива>'"));
			ОбластьПодписиПринял.Параметры.ДолжностьПринял = НСтр("ru = '<Должность работника архива>'");
		Иначе
			ОбластьПодписиПринял.Параметры.Принял = 
				?(ЗначениеЗаполнено(Принял), ОбщегоНазначенияДокументооборот.ЗначениеРеквизитаОбъектаВПривилегированномРежиме(
					Принял, "ПредставлениеВДокументах"), НСтр("ru = '<ФИО работника архива>'"));
			ДолжностьПринял = РаботаСПользователями.ПолучитьДолжность(Принял);
			ОбластьПодписиПринял.Параметры.ДолжностьПринял = 
				?(ЗначениеЗаполнено(ДолжностьПринял), ДолжностьПринял, НСтр("ru = '<Должность работника архива>'"));
		КонецЕсли;
		ОбластьПодписиПринял.Параметры.ДатаПриемки = 
			?(ЗначениеЗаполнено(ВыборкаДетали.ДатаПередачи), Формат(ВыборкаДетали.ДатаПриемки, "ДЛФ=D"), 
				НСтр("ru = '<Дата приемки>'"));
		
		ТабличныйДокумент.Вывести(ОбластьПодписиПринял);
		
		Если ВыводитьРеестрФайлов Тогда
			// Реестр файлов документов
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
			
			ОбластьЗаголовокРеестра = Макет.ПолучитьОбласть("ЗаголовокРеестраФайлов");
			ТабличныйДокумент.Вывести(ОбластьЗаголовокРеестра);
			
			ОбластьШапкаРеестра = Макет.ПолучитьОбласть("ШапкаРеестраФайлов");
			ТабличныйДокумент.Вывести(ОбластьШапкаРеестра);
			
			Номер = 0;
			НомерДокументаПоОписи = 0;
			
			ВыборкаИндексНоменклатуры.Сбросить();
			Пока ВыборкаИндексНоменклатуры.Следующий() Цикл
				ВыборкаДокументы = ВыборкаИндексНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДокументы.Следующий() Цикл
					Если Не ЗначениеЗаполнено(ВыборкаДокументы.Документ) Тогда
						Продолжить;
					КонецЕсли;
					НомерДокументаПоОписи = НомерДокументаПоОписи + 1;
					ОбластьСтрокаРеестра = Макет.ПолучитьОбласть("СтрокаРеестраФайлов");
					ВыборкаСтроки = ВыборкаДокументы.Выбрать();
					Пока ВыборкаСтроки.Следующий() Цикл 
						Если ЗначениеЗаполнено(ВыборкаСтроки.ИмяФайла) Тогда
							Номер = Номер + 1;
							ОбластьСтрокаРеестра.Параметры.Номер = Номер;
							ОбластьСтрокаРеестра.Параметры.НомерДокументаПоОписи = НомерДокументаПоОписи;
							ОбластьСтрокаРеестра.Параметры.НаименованиеФайла  =  ВыборкаСтроки.ИмяФайла;
							ОбластьСтрокаРеестра.Параметры.ДатаИзменения = ВыборкаСтроки.ДатаИзменения;
							ОбластьСтрокаРеестра.Параметры.Объем = ВыборкаСтроки.Размер;
							ОбластьСтрокаРеестра.Параметры.Формат =  ВыборкаСтроки.Расширение;
							ТабличныйДокумент.Вывести(ОбластьСтрокаРеестра);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
			
		// В табличном документе зададим имя области в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДетали.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
КонецПроцедуры

// Возвращает массив возможных статусов обмена с 1С:Архив для документа Передача дел в Архив.
//
// Параметры:
//  Документ - ДокументСсылка.ПередачаДелВАрхив - документ, по которому определяются возмодные статусы.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.СтатусыОбменаСАрхивом - возможные статусы обмена с 1С:Архив для документа.
//
Функция ПолучитьСписокВыбораСтатусовВыгрузкиВАрхив(ВыбранныеДокументы) Экспорт
	
	СтатусыОбмена = Перечисления.СтатусыОбменаСАрхивом;
	СписокВыбораСтатусов = Новый Массив;
	
	Для Каждого Документ Из ВыбранныеДокументы Цикл	
		Если Документ.СтатусВыгрузкиВАрхив = СтатусыОбмена.ПустаяСсылка()
			Или Документ.СтатусВыгрузкиВАрхив = СтатусыОбмена.НеГотовКВыгрузке
			Или Документ.СтатусВыгрузкиВАрхив = СтатусыОбмена.ГотовКВыгрузке Тогда
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.НеГотовКВыгрузке, СписокВыбораСтатусов);
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.ГотовКВыгрузке, СписокВыбораСтатусов); 
		ИначеЕсли Документ.СтатусВыгрузкиВАрхив = СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив Тогда  
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.ОбнаруженыОшибкиПриЗагрузкеВАрхив, СписокВыбораСтатусов);
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.ГотовКВыгрузке, СписокВыбораСтатусов);
		ИначеЕсли Документ.СтатусВыгрузкиВАрхив = СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве Тогда 
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.ОбнаруженыОшибкиПриПроверкеВАрхиве, СписокВыбораСтатусов);
			ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусыОбмена.ГотовКВыгрузке, СписокВыбораСтатусов);
		Иначе
			ДобавитьСтатусВыгрузкиВАрхивВСписок(Документ.СтатусВыгрузкиВАрхив, СписокВыбораСтатусов);
		КонецЕсли;
		ИндексСтатуса = СписокВыбораСтатусов.Найти(Документ.СтатусВыгрузкиВАрхив);
		Если ИндексСтатуса <> Неопределено Тогда
			СписокВыбораСтатусов.Удалить(ИндексСтатуса);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВыбораСтатусов;
	
КонецФункции 

Процедура ДобавитьСтатусВыгрузкиВАрхивВСписок(СтатусОбмена, Список)
	
	Если Список.Найти(СтатусОбмена) = Неопределено Тогда
		Список.Добавить(СтатусОбмена);	
	КонецЕсли;
		
КонецПроцедуры

Функция ВидОписиПоНоменклатуреДел(МассивДокументов)
	
	Результат = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураДел.КатегорияДела КАК КатегорияДела,
		|	НоменклатураДел.ПоЛичномуСоставу,
		|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ПередачаДелВАрхивДелаХраненияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураДел КАК НоменклатураДел
		|		ПО ПередачаДелВАрхивДелаХраненияДокументов.ДелоХраненияДокументов.НоменклатураДел = НоменклатураДел.Ссылка
		|ГДЕ
		|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка В (&МассивДокументов)
		|ИТОГИ
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ВыборкаСтроки = Выборка.Выбрать();
		Если ВыборкаСтроки.Следующий() И ВыборкаСтроки.Количество() = 1 Тогда
			Если ВыборкаСтроки.ПоЛичномуСоставу = Истина Тогда
				Результат.Вставить(ВыборкаСтроки.Ссылка, НСтр("ru = 'по личному составу'"));
			ИначеЕсли ВыборкаСтроки.КатегорияДела = Перечисления.КатегорииДел.ВременноеСвыше10 Тогда
				Результат.Вставить(ВыборкаСтроки.Ссылка, НСтр("ru = 'временного (свыше 10 лет) хранения'"));
			ИначеЕсли ВыборкаСтроки.КатегорияДела = Перечисления.КатегорииДел.ВременноеДо10 Тогда
				Результат.Вставить(ВыборкаСтроки.Ссылка, НСтр("ru = 'временного (до 10 лет) хранения'"));
			Иначе
				Результат.Вставить(ВыборкаСтроки.Ссылка, НСтр("ru = 'постоянного хранения'"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция ПериодыДокументовПоСдаточнойОписи(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктуальныеПериоды = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МИНИМУМ(ГОД(ВнутренниеДокументы.ДатаРегистрации)) КАК ГодНачала,
		|	МАКСИМУМ(ГОД(ВнутренниеДокументы.ДатаРегистрации)) КАК ГодОкончания
		|ИЗ
		|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ПередачаДелВАрхивДелаХраненияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|		ПО ПередачаДелВАрхивДелаХраненияДокументов.ДелоХраненияДокументов = ВнутренниеДокументы.Дело
		|ГДЕ
		|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МИНИМУМ(ГОД(ВходящиеДокументы.ДатаРегистрации)) КАК ГодНачала,
		|	МАКСИМУМ(ГОД(ВходящиеДокументы.ДатаРегистрации)) КАК ГодОкончания
		|ИЗ
		|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ПередачаДелВАрхивДелаХраненияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВходящиеДокументы КАК ВходящиеДокументы
		|		ПО ПередачаДелВАрхивДелаХраненияДокументов.ДелоХраненияДокументов = ВходящиеДокументы.Дело
		|ГДЕ
		|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МИНИМУМ(ГОД(ИсходящиеДокументы.ДатаРегистрации)) КАК ГодНачала,
		|	МАКСИМУМ(ГОД(ИсходящиеДокументы.ДатаРегистрации)) КАК ГодОкончания
		|ИЗ
		|	Документ.ПередачаДелВАрхив.ДелаХраненияДокументов КАК ПередачаДелВАрхивДелаХраненияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|		ПО ПередачаДелВАрхивДелаХраненияДокументов.ДелоХраненияДокументов = ИсходящиеДокументы.Дело
		|ГДЕ
		|	ПередачаДелВАрхивДелаХраненияДокументов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		АктуальныеПериоды.Добавить(Формат(Выборка.ГодНачала, "ЧГ=0"));
		Если Выборка.ГодНачала <> Выборка.ГодОкончания Тогда
			АктуальныеПериоды.Добавить(Формат(Выборка.ГодОкончания, "ЧГ=0"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат АктуальныеПериоды;
	
КонецФункции

#КонецЕсли
